### Import Dependencies

In [44]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from config import db_user, db_password

### Extract CSVs into DataFrames

In [45]:
athletes_file = "Resources/athlete_events.csv"
athletes_df = pd.read_csv(athletes_file)
athletes_df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [46]:
cost_per_file = "Resources/Cost_per_ event_and_cost_ per_athlete_in_the_Olympics.csv"
cost_per_df = pd.read_csv(cost_per_file)
cost_per_df.head()

,Games,Year,Country,Type,"Cost per event, mio. USD","Cost per athlete, mio. USD","event,"
0,Tokyo,1964,Japan,Summer,1.7,0.1,NaN
1,Munich,1972,Germany,Summer,5.2,0.1,NaN
2,Montreal,1976,Canada,Summer,30.8,1.0,NaN
3,Moscow,1980,Soviet Union,Summer,31.2,1.2,NaN
4,Los Angeles,1984,United States,Summer,3.3,0.1,NaN

In [47]:
total_cost_file = "Resources/Costs_ of_ the_ Olympic_ Games.csv"
total_cost_df = pd.read_csv(total_cost_file)
total_cost_df.head()

         Games  Year  Country    Type  Events  Athletes Cost, Billion USD
0         Rome  1960    Italy  Summer     150      5338               NaN
1        Tokyo  1964    Japan  Summer     163      5152             0.282
2  Mexico City  1968   Mexico  Summer     172      5516             n/a**
3       Munich  1972  Germany  Summer     195      7234             1.009
4     Montreal  1976   Canada  Summer     198      6048             6.093

### Transform athletes DataFrames

In [48]:
# Arrange Medals by Categories
#create a dataFrame for medals
df = athletes_df[["Medal"]]

#Create DataFrame for Gold
df1=df[df['Medal']=='Gold']
df1 = df1.rename(columns={"Medal": "Gold"})

#Create DataFrame for Silver
df2=df[df['Medal']=='Silver']
df2 = df2.rename(columns={"Medal": "Silver"})

#Create DataFrame for Silver
df3=df[df['Medal']=='Bronze']
df3 = df3.rename(columns={"Medal": "Bronze"})

# Concat DataFrames
df4 = pd.concat([df1, df2, df3], axis = 1)

# Rename the column headers
medal_df = df4.rename(columns={"Medal": "Gold", "Medal": "Silver", "Medal": "Bronze"})

#Update athletes_df with medal_df
ext_athletes_df = pd.concat([athletes_df, medal_df], axis = 1)

extract and transform medal dataframes to include a medal countÂ¶

In [49]:
gold_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Gold"]]
# add an empty column
gold_df.insert(2,'Tot_Gold','')
gold_df = gold_df.groupby(["City", "Year", "Season",'NOC','Gold'], as_index=False)['Tot_Gold'].count()

In [50]:
silver_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Silver"]]
# add an empty column
silver_df.insert(2,'Tot_Silver','')
silver_df = silver_df.groupby(["City", "Year", "Season",'NOC','Silver'], as_index=False)['Tot_Silver'].count()

In [51]:
bronze_df = ext_athletes_df[["City", "Year", "Season","NOC",  "Bronze"]]
# add an empty column
bronze_df.insert(2,'Tot_Bronze','')
bronze_df = bronze_df.groupby(["City", "Year", "Season",'NOC','Bronze'], as_index=False)['Tot_Bronze'].count()

In [52]:
medals_df = pd.merge(gold_df, silver_df, how='left', on=["City", "Year", "Season", "NOC"])
medals_tot = pd.merge(medals_df, bronze_df, how='left', on=["City", "Year", "Season", "NOC"])

#convert columns to integer type
#new_athlete_df.Tot_Gold = new_athlete_df.Tot_Gold.apply(int)
#new_athlete_df.Tot_Bronze = new_athlete_df.Tot_Bronze.apply(in
medals_tot = medals_tot.fillna(0)

#format columns

#medals_tot = medals_tot["Tot_Silver"].astype("int")
#medals_tot = medals_tot["Tot_Bronze"].astype("int")

medals_tot['Tot_Silver'] = medals_tot['Tot_Silver'].map("{: .0f}".format)
medals_tot['Tot_Bronze'] = medals_tot['Tot_Bronze'].map("{: .0f}".format)

In [53]:
# Rename DataFrame
new_athletes_df = medals_tot[["City", "Year", "NOC", "Tot_Gold", "Tot_Silver", "Tot_Bronze"]]
new_athlete_df = new_athletes_df.dropna(subset=["Tot_Gold", "Tot_Silver", "Tot_Bronze"], how='all')

#Rename the column headers
new_athletes_df = new_athletes_df.rename(columns={"City": "city_olympics", "Year": "year_olympics",  "NOC": "country_team"})
#new_athletes_df["Id"] = new_athletes_df["year_olympics"].astype(str) + " " + new_athletes_df["city_olympics"]
#set the index
#new_athletes_df.insert(loc=0, column='year_id', value=np.arange(len(new_athletes_df)))

new_athletes_df.head()

  city_olympics  year_olympics country_team  Tot_Gold Tot_Silver Tot_Bronze
0   Albertville           1992          AUT         9         10         10
1   Albertville           1992          CAN         5         28          3
2   Albertville           1992          EUN        35         10         14
3   Albertville           1992          FIN         6          1          6
4   Albertville           1992          FRA         5          6          1

In [54]:
#Correcting the names of cities to be the same in two df
new_athletes_df["city_olympics"].replace({'Moskva': 'Moscow', "Rio de Janeiro": "Rio", "Roma": "Rome", "Athina": "Athens" }, inplace=True)


#Checking if the values were changed 
#print(new_athletes_df.loc[athletes_df['City'] == 'Moskva'])
#print(new_athletes_df.loc[athletes_df['City'] == 'Rio de Janeiro'])
#print(new_athletes_df.loc[athletes_df['City'] == 'Roma'])
#print(new_athletes_df.loc[athletes_df['City'] == 'Athina'])

### Transform cost_per DataFrames

In [55]:
# Create a filtered dataframe from specific columns
cost_per_cols = ["Games", "Country", "Year", "Type", "Cost per event, mio. USD", "Cost per athlete, mio. USD"]
new_cost_per_df= cost_per_df[cost_per_cols].copy()

# Rename the column headers
new_cost_per_df = new_cost_per_df.rename(columns={"Type": "season", "Games": "city_olympics", "Year": "year_olympics", 
                                                  "Country" : "country", 
                                                  "Cost per event, mio. USD": "cost_event_m", 
                                                  "Cost per athlete, mio. USD": "cost_athlete_m"})

#new_athletes_df["Id"] = new_athletes_df["year_olympics"].astype(str) + " " + new_athletes_df["city_olympics"]
# Clean the data by dropping duplicates and setting the index
#new_cost_per_df.drop_duplicates("Id", inplace=True)
#new_cost_per_df.set_index("Id", inplace=True)

new_cost_per_df.head()

,city_olympics,country,year_olympics,season,cost_event_m,cost_athlete_m
0,Tokyo,Japan,1964,Summer,1.7,0.1
1,Munich,Germany,1972,Summer,5.2,0.1
2,Montreal,Canada,1976,Summer,30.8,1.0
3,Moscow,Soviet Union,1980,Summer,31.2,1.2
4,Los Angeles,United States,1984,Summer,3.3,0.1

### Transform total_cost DataFrames

In [56]:
# Create a filtered dataframe from specific columns
total_cost_cols = ["Games", "Country", "Year", "Type", "Events", "Athletes", "Cost, Billion USD"]
new_total_cost_df= total_cost_df[total_cost_cols].copy()

#Replacing n/a values to NaN 
new_total_cost_df["Cost, Billion USD"].replace({"n/a**": "NaN"}, inplace=True)

# Rename the column headers
new_total_cost_df = new_total_cost_df.rename(columns={"Games": "city_olympics",  
                                                      "Type": "season", "city": "city_olympics", "Year": "year_olympics", 
                                                      "Country" : "country", "Events": "event", "Athletes" : "athletes",
                                                      "Cost, Billion USD" : "event_cost_b_usd"})

new_total_cost_df.head()

,city_olympics,country,year_olympics,season,event,athletes,event_cost_b_usd
0,Rome,Italy,1960,Summer,150,5338,NaN
1,Tokyo,Japan,1964,Summer,163,5152,0.282
2,Mexico City,Mexico,1968,Summer,172,5516,NaN
3,Munich,Germany,1972,Summer,195,7234,1.009
4,Montreal,Canada,1976,Summer,198,6048,6.093

In [57]:
#Merge two df : cost per and total cost
two_df = pd.merge( left =new_total_cost_df, right =new_cost_per_df, how='left', left_on = ('year_olympics', 'city_olympics'), 
                                                                             right_on  = ('year_olympics', 'city_olympics'))
#two_combined_df.sort_values(["city_olympics"])

two_combined_df = two_df[["city_olympics", "country_x", "year_olympics", "season_x", "event", 
                          "athletes", "event_cost_b_usd", "cost_event_m", "cost_athlete_m"]]
two_combined_df.copy()

,city_olympics,country_x,year_olympics,season_x,event,athletes,event_cost_b_usd,cost_event_m,cost_athlete_m
0,Rome,Italy,1960,Summer,150,5338,NaN,NaN,NaN
1,Tokyo,Japan,1964,Summer,163,5152,0.282,1.7,0.10
2,Mexico City,Mexico,1968,Summer,172,5516,NaN,NaN,NaN
3,Munich,Germany,1972,Summer,195,7234,1.009,5.2,0.10
4,Montreal,Canada,1976,Summer,198,6048,6.093,30.8,1.00
5,Moscow,Soviet Union,1980,Summer,203,5179,6.331,31.2,1.20
6,Los Angeles,United States,1984,Summer,221,6829,0.719,3.3,0.10
7,Seoul,South Korea,1988,Summer,237,8397,NaN,NaN,NaN
8,Barcelona,Spain,1992,Summer,257,9356,9.687,37.7,1.00
9,Atlanta,United States,1996,Summer,271,10318,4.143,15.3,0.40
10,Sydney,Australia,2000,Summer,300,10651,5.026,16.8,0.50
11,Athens,Greece,2004,Summer,301,10625,2.942,9.8,0.30
12,Beijing,China,2008,Summer,302,10942,6.81,22.5,0.60
13,London,United Kingdom,2012,Summer,302,10568,14.957,49.5,1.40
14,Rio,Brazil,2016,Summer,306,10500,4.557,14.9,0.40
15,Squaw Valley,United States,1960,Winter,27,665,NaN,NaN,NaN
16,Innsbruck,Austria,1964,Winter,34,1091,0.022,0.6,0.02
17,Grenoble,France,1968,Winter,35,1158,0.888,25.4,0.80
18,Sapporo,Japan,1972,Winter,35,1006,0.117,3.4,0.10
19,Innsbruck,Austria,1976,Winter,37,1123,0.118,3.2,0.10
20,Lake Placid,United States,1980,Winter,38,1072,0.435,11.5,0.40
21,Sarajevo,Yugoslavia,1984,Winter,39,1272,NaN,NaN,NaN
22,Calgary,Canada,1988,Winter,46,1432,1.109,24.1,0.80
23,Albertville,France,1992,Winter,57,1801,1.997,35.0,1.10
24,Lillehammer,Norway,1994,Winter,61,1737,2.228,36.5,1.30
25,Nagano,Japan,1998,Winter,68,2176,2.227,32.7,1.00
26,Salt Lake City,United States,2002,Winter,78,2399,2.52,32.3,1.10
27,Torino,Italy,2006,Winter,84,2508,4.366,52.0,1.70
28,Vancouver,Canada,2010,Winter,86,2566,2.54,29.5,1.00
29,Sochi,Russia,2014,Winter,98,2780,21.89,223.4,7.90

Create a list of unique cities in order to transfer to DB

In [58]:
#list of all cities in athlets df
unique_athletes_table_city = new_athletes_df.city_olympics.unique()

#convert the list of athletes df cities to df
first_list_city_athletes_df =pd.DataFrame(unique_athletes_table_city, columns=['city_olympics']) 

#list of all cities in combined ( 2 & 3) df
second_list_olymp_city = two_combined_df.city_olympics.unique()

#convert the list of all cities to df
second_list_city_olympics_df =pd.DataFrame(second_list_olymp_city, columns=['city_olympics']) 

#combine two city lists  and remove duplicates
two_city_df = [first_list_city_athletes_df, second_list_city_olympics_df]
concat_two_city_df = pd.concat(two_city_df)
city_olympics_df = concat_two_city_df.drop_duplicates("city_olympics")

#set the index
city_olympics_df.insert(loc=0, column='city_id', value=np.arange(len(city_olympics_df)))

city_olympics_df.sort_values(["city_olympics"])

    city_id           city_olympics
0         0             Albertville
1         1               Amsterdam
2         2               Antwerpen
3         3                  Athens
4         4                 Atlanta
5         5               Barcelona
6         6                 Beijing
7         7                  Berlin
8         8                 Calgary
9         9                Chamonix
10       10       Cortina d'Ampezzo
11       11  Garmisch-Partenkirchen
12       12                Grenoble
13       13                Helsinki
14       14               Innsbruck
15       15             Lake Placid
16       16             Lillehammer
17       17                  London
18       18             Los Angeles
19       19               Melbourne
20       20             Mexico City
21       21                Montreal
22       22                  Moscow
23       23                  Munich
24       24                  Nagano
25       25                    Oslo
26       26                   Paris
27       27                     Rio
28       28                    Rome
29       29          Salt Lake City
30       30            Sankt Moritz
31       31                 Sapporo
32       32                Sarajevo
33       33                   Seoul
34       34                   Sochi
35       35            Squaw Valley
36       36               St. Louis
37       37               Stockholm
38       38                  Sydney
39       39                   Tokyo
40       40                  Torino
41       41               Vancouver

In [59]:
#Creating a list of unique city in order to transfer to DB
#list of all cities in athlets df
unique_athletes_table_year = new_athletes_df.year_olympics.unique()
#convert the list of athletes df cities to df
first_list_year_athletes_df =pd.DataFrame(unique_athletes_table_year, columns=['year_olympics']) 


#list of all cities in combined ( 2 & 3) df
second_list_olymp_year = two_combined_df.year_olympics.unique()
#convert the list of all cities to df
second_list_year_olympics_df =pd.DataFrame(second_list_olymp_year, columns=['year_olympics']) 


#combine two city lists  and remove duplicates
two_year_df = [first_list_year_athletes_df, second_list_year_olympics_df]
concat_two_year_df = pd.concat(two_year_df)
year_olympics_df = concat_two_year_df.drop_duplicates("year_olympics")

#set the index
year_olympics_df.insert(loc=0, column='year_id', value=np.arange(len(year_olympics_df)))

year_olympics_df.sort_values(["year_olympics"])

    year_id  year_olympics
3         3           1896
25       25           1900
30       30           1904
4         4           1906
19       19           1908
31       31           1912
2         2           1920
10       10           1924
1         1           1928
16       16           1932
8         8           1936
20       20           1948
13       13           1952
11       11           1956
27       27           1960
14       14           1964
12       12           1968
23       23           1972
15       15           1976
17       17           1980
22       22           1984
9         9           1988
0         0           1992
18       18           1994
6         6           1996
24       24           1998
32       32           2000
28       28           2002
5         5           2004
33       33           2006
7         7           2008
34       34           2010
21       21           2012
29       29           2014
26       26           2016

In [60]:
#df['rating'] = np.where(df['line_race']==0, 0, df['rating'])

#new_athelets_df 
#year_olympics_df
new_athletes_df1= pd.merge(new_athletes_df, year_olympics_df, how='left', on=["year_olympics"])
new_athletes_df1.head()

,city_olympics,year_olympics,country_team,Tot_Gold,Tot_Silver,Tot_Bronze,year_id
0,Albertville,1992,AUT,9,10,10,0
1,Albertville,1992,CAN,5,28,3,0
2,Albertville,1992,EUN,35,10,14,0
3,Albertville,1992,FIN,6,1,6,0
4,Albertville,1992,FRA,5,6,1,0

In [61]:
new_athletes_df2= pd.merge(new_athletes_df1, city_olympics_df, how='left', on=["city_olympics"])
new_athletes_df2.head()

,city_olympics,year_olympics,country_team,Tot_Gold,Tot_Silver,Tot_Bronze,year_id,city_id
0,Albertville,1992,AUT,9,10,10,0,0
1,Albertville,1992,CAN,5,28,3,0,0
2,Albertville,1992,EUN,35,10,14,0,0
3,Albertville,1992,FIN,6,1,6,0,0
4,Albertville,1992,FRA,5,6,1,0,0

In [ ]:
new_athletes_cols=["year_id", "city_id", "year_olympics", "country_team", "Tot_Gold", "Tot_Silver", "Tot_Bronze"]
new_athletes_df4= new_athletes_df3[new_athletes_cols].copy()

#cost_per_cols = ["Games", "Country", "Year", "Type", "Cost per event, mio. USD", "Cost per athlete, mio. USD"]
new_cost_per_df= cost_per_df[cost_per_cols].copy()

In [43]:
# Connect to local

rds_connection_string = f'{db_user}:{db_password}@localhost:5432/Olympics'
engine = create_engine(f'postgresql://{rds_connection_string}')
engine

Engine(postgresql://postgres:***@localhost:5432/Olympics)

In [254]:
#Check for table
engine.table_names()

<ipython-input-254-61e16a250986>:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['city_olympics', 'year_olympics', 'new_athletes', 'olympic_games']

In [263]:
year_olympics_df.to_sql(name='year_olympics', con=engine, if_exists='append', index=False)

In [260]:
print(city_olympics_df['city_olympics'].dtypes)
#df['DataFrame Column'].dtypes

object

In [271]:
city_olympics_df.to_sql(name='city_olympics', con=engine, if_exists='append', index=False)

In [274]:
new_athletes_df.to_sql(name='new_athletes', con=engine, if_exists='append', index=False)

ProgrammingError: (psycopg2.errors.UndefinedColumn) column "city_olympics" of relation "new_athletes" does not exist
LINE 1: INSERT INTO new_athletes (city_olympics, year_olympics, coun...
                                  ^

[SQL: INSERT INTO new_athletes (city_olympics, year_olympics, country_team, "Tot_Gold", "Tot_Silver", "Tot_Bronze") VALUES (%(city_olympics)s, %(year_olympics)s, %(country_team)s, %(Tot_Gold)s, %(Tot_Silver)s, %(Tot_Bronze)s)]
[parameters: ({'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'AUT', 'Tot_Gold': 9, 'Tot_Silver': ' 10', 'Tot_Bronze': ' 10'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'CAN', 'Tot_Gold': 5, 'Tot_Silver': ' 28', 'Tot_Bronze': ' 3'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'EUN', 'Tot_Gold': 35, 'Tot_Silver': ' 10', 'Tot_Bronze': ' 14'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'FIN', 'Tot_Gold': 6, 'Tot_Silver': ' 1', 'Tot_Bronze': ' 6'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'FRA', 'Tot_Gold': 5, 'Tot_Silver': ' 6', 'Tot_Bronze': ' 1'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'GER', 'Tot_Gold': 14, 'Tot_Silver': ' 17', 'Tot_Bronze': ' 7'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'ITA', 'Tot_Gold': 4, 'Tot_Silver': ' 9', 'Tot_Bronze': ' 8'}, {'city_olympics': 'Albertville', 'year_olympics': 1992, 'country_team': 'JPN', 'Tot_Gold': 3, 'Tot_Silver': ' 2', 'Tot_Bronze': ' 7'}  ... displaying 10 of 1115 total bound parameter sets ...  {'city_olympics': 'Vancouver', 'year_olympics': 2010, 'country_team': 'SWE', 'Tot_Gold': 11, 'Tot_Silver': ' 3', 'Tot_Bronze': ' 4'}, {'city_olympics': 'Vancouver', 'year_olympics': 2010, 'country_team': 'USA', 'Tot_Gold': 12, 'Tot_Silver': ' 63', 'Tot_Bronze': ' 22'})]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [ ]:
two_combined_df.to_sql(name='olympic_games', con=engine, if_exists='append', index=False)

In [265]:
pd.read_sql_query('select * from year_olympics', con=engine).head()

   year_id  year_olympics
0        0           1992
1        1           1928
2        2           1920
3        3           1896
4        4           1906